# IsSolid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericForm..::..IsSolid Property
GenericForm Class See Also
---
Identifies if the GenericForm is a solid or a void element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSolid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSolid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSolid {
	bool get ();
}
```

# ### Field Value
True if the form is a solid, false if the solid is a void element.
# See Also
GenericForm Class
Autodesk.Revit.DB Namespace